import pytest

from tools.check_balance import is_balanced


@pytest.mark.parametrize(
    'string,result',
    (
        ("", "Сбалансированно"),
        ("(((([{}]))))", "Сбалансированно"),
        ("[([])((([[[]]])))]{()}", "Сбалансированно"),
        ("{{[()]}}", "Сбалансированно"),
        ("()", "Сбалансированно"),
        ("}{", "Несбалансированно"),
        ("{{[(])]}}", "Несбалансированно"),
        ("[[{())}]", "Несбалансированно"),
        ("(((", "Несбалансированно"),
        (")))", "Несбалансированно"),
        ("(()", "Несбалансированно"),
        ("())", "Несбалансированно"),
        ("print(int('96'))", "Сбалансированно"),
        ("def func[x]: {return (x + 1)", "Несбалансированно"),
        ("   ( [ { } ] )   ", "Сбалансированно"),
    )
)
def test_in_balanced_returns_result_checking_string(string, result):
    assert is_balanced(string) == result